app/controllers/songs_controller.rb

  def show
    # binding.pry
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if !@artist
        redirect_to artists_path, alert: "Artist not found."
      end
      @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]